# Queries about Movies

For each of the questions in this notebook, you should create an answer using both relational algebra as well as sql.

This notebook will enable you to check your answer. To do so run your query cell and then run the checker cell. Running the cells out of order will lead to unpredictable results.

In [6]:
import warnings
warnings.filterwarnings('ignore')

from reframe import Relation
from sols4 import *

In [7]:
cast = Relation('/home/faculty/millbr02/pub/cast.csv',sep=',')
title = Relation('/home/faculty/millbr02/pub/titles.csv',sep=',')
release_date = Relation('/home/faculty/millbr02/pub/release_dates.csv',sep=',')

In [8]:
cast.query("type == 'actor' & year == 2015").njoin(release_date.query("country == 'Norway'")).project(['title','name']).sort(['name']).head()

                       title                name
1511              Steve Jobs         $hutter Boy
378   Straight Outta Compton         $hutter Boy
150                      Spy             50 Cent
0                   Southpaw             50 Cent
6599                     Joy  ?dgar (II) Ram?rez

In [9]:
%load_ext sql

In [10]:
%sql postgresql://aljamo01:@localhost/movies

'Connected: aljamo01@movies'

In [11]:
%%sql

SELECT title, name
FROM moviecast NATURAL JOIN release_date
WHERE type = 'actor' AND year = 2015 AND country = 'Norway'
ORDER BY name
LIMIT 10;

10 rows affected.

[('Southpaw', '50 Cent'),
 ('Spy', '50 Cent'),
 ('Pitch Perfect 2', 'Aakomon Jones'),
 ('Pan', 'Aaran Mitra'),
 ('Insurgent', 'Aaron Brewstar'),
 ('Max', 'Aaron Dozzi'),
 ('Ted 2', 'Aaron F. Randell'),
 ('Avengers: Age of Ultron', 'Aaron Himelstein'),
 ('The Night Before (II)', 'Aaron (II) Hill'),
 ('Star Wars: Episode VII - The Force Awakens', 'Aaron (IV) Kennedy')]

# Questions Start Here

### 1. Display the title and the name where the lead actor name and character name are the same for movies cast in 2007.

In [12]:
cast.query('type == "actor" & year == 2007 & name == character & n==1').njoin(title).project(['title', 'name'])

                              title              name
0                         Maharadhi       Balakrishna
1               Good Luck with That  Igor Breakenback
2                  My Name Is Bruce    Bruce Campbell
3            Yi daegeun, Yi daikeun      Lee Dae-Geun
4  The Last Lecture by Randy Pausch      Randy Pausch
5                         The Minis     Dennis Rodman

In [13]:

checker_1R(release_date,cast,_)

Correct!

In [14]:
%%sql
SELECT title,name
FROM moviecast
WHERE year = 2007 and n = 1 and name = character;

6 rows affected.

[('Maharadhi', 'Balakrishna'),
 ('Good Luck with That', 'Igor Breakenback'),
 ('My Name Is Bruce', 'Bruce Campbell'),
 ('Yi daegeun, Yi daikeun', 'Lee Dae-Geun'),
 ('The Last Lecture by Randy Pausch', 'Randy Pausch'),
 ('The Minis', 'Dennis Rodman')]

In [15]:

checker_1S(_)

Correct!

### 2. What are the ten most common movie character names between 1990 and 2010 from most common to least? Include the counts.

In [16]:
cast.query('year> 1990 & year < 2010').groupby(['character']).count('year').project(['character', 'count_year']).sort(['count_year'],ascending=False).head(10)

        character  count_year
192579    Himself        7212
101918     Dancer        3585
143867      Extra        2655
434895    Student        2401
117721     Doctor        2057
39892   Bartender        2051
191235    Herself        2049
336612      Nurse        2023
384757   Reporter        1963
480353   Waitress        1760

In [17]:
checker_2R(release_date,cast,_)

Error! Did you name the columns correctly?
Columns' names expected: character, count_name.

AssertionError:

In [18]:
%%sql
SELECT character, count(year)
FROM moviecast
WHERE year > 1990 and year < 2010
GROUP BY character
ORDER BY count(year) DESC
LIMIT 10;

10 rows affected.

[('Himself', 7212),
 ('Dancer', 3585),
 ('Extra', 2655),
 ('Student', 2401),
 ('Doctor', 2057),
 ('Bartender', 2051),
 ('Herself', 2049),
 ('Nurse', 2023),
 ('Reporter', 1963),
 ('Waitress', 1760)]

In [ ]:
checker_2S(_)

### 3. List the name of each actress that has played the role of Stella more than once. Include the count column.

In [19]:
cast.query('type == "actress" & character == "Stella"').groupby(['name']).count('year').query('count_year > 1').project(['name','count_year'])

                 name  count_year
2         Abi Burgess           2
20          Amy Gross           2
121      Elise Vargas           2
324  Martina Tremante           2
327       Mary Wickes           3
366   Ophelia Shtruhl           2
383  Perla Liberatori           3
427   Sandra Loncaric           2
440      Sina Tkotsch           2
473  Suzanne Gonzales           2
511       Zoey Vargas           2

In [ ]:
checker_3R(release_date,cast,_)

In [20]:
%%sql
SELECT name, count(year)
FROM moviecast
WHERE character = 'Stella' and type = 'actress'
GROUP BY name
HAVING count(year) > 1;

11 rows affected.

[('Suzanne Gonzales', 2),
 ('Ophelia Shtruhl', 2),
 ('Perla Liberatori', 3),
 ('Sina Tkotsch', 2),
 ('Martina Tremante', 2),
 ('Sandra Loncaric', 2),
 ('Mary Wickes', 3),
 ('Zoey Vargas', 2),
 ('Elise Vargas', 2),
 ('Abi Burgess', 2),
 ('Amy Gross', 2)]

In [ ]:
checker_3S(_)

### 4. Display all information about the entire cast, in "n"-order, for the 2007 version of "Sleuth".

In [21]:
cast.query('year == 2007 & title == "Sleuth"').sort(['n'])

          title  year                 name     type          character    n
293979   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1168226  Sleuth  2007             Jude Law    actor               Milo  2.0
1631579  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
233198   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
336873   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2452309  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3015769  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN

In [ ]:
checker_4R(release_date,cast,_)

In [22]:
%%sql
SELECT *
FROM moviecast
WHERE year = 2007 and title = 'Sleuth'
ORDER BY n;

7 rows affected.

[(293979, 'Sleuth', 2007, 'Michael Caine', 'actor', 'Andrew', 1.0),
 (1168226, 'Sleuth', 2007, 'Jude Law', 'actor', 'Milo', 2.0),
 (1631579, 'Sleuth', 2007, 'Harold Pinter', 'actor', 'Man on T.V.', 3.0),
 (336873, 'Sleuth', 2007, 'Alec (II) Cawthorne', 'actor', 'Inspector Doppler', None),
 (233198, 'Sleuth', 2007, 'Kenneth Branagh', 'actor', 'Other Man on T.V.', None),
 (2452309, 'Sleuth', 2007, 'Eve (II) Channing', 'actress', 'Marguerite Wyke', None),
 (3015769, 'Sleuth', 2007, "Carmel O'Sullivan", 'actress', 'Maggie', None)]

In [ ]:
checker_4S(_)

### 5. Display the number of roles available to actors for each year starting from the year 2000 up to and not including 2015. Ordered by year from highest to lowest.

In [24]:
cast.query('type == "actor" & year >= 2000 & year < 2015').groupby(['year']).count('name').sort(['year'], ascending=False)

    year  count_name
14  2014       92156
13  2013       87427
12  2012       83934
11  2011       79676
10  2010       73065
9   2009       74747
8   2008       63001
7   2007       56463
6   2006       54188
5   2005       47856
4   2004       40801
3   2003       37544
2   2002       35255
1   2001       34218
0   2000       32817

In [ ]:
checker_5R(release_date,cast,_)

In [25]:
%%sql
SELECT year, count(name)
FROM moviecast
WHERE year>=2000 and year <2015 and type = 'actor'
GROUP BY year
ORDER BY count(year) DESC;

15 rows affected.

[(2014, 92157),
 (2013, 87428),
 (2012, 83936),
 (2011, 79679),
 (2009, 74748),
 (2010, 73065),
 (2008, 63001),
 (2007, 56464),
 (2006, 54188),
 (2005, 47857),
 (2004, 40801),
 (2003, 37544),
 (2002, 35255),
 (2001, 34218),
 (2000, 32818)]

In [ ]:
checker_5S(_)